In [2]:
import pandas as pd

In [4]:
data_frame = pd.read_csv("C:/Users/91749/Downloads/potus_visitors_2015.csv")

In [6]:
data_frame.head(5)

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard

In [11]:
data_frame.count()

name                 47954
appt_made_date       47954
appt_start_date      47954
appt_end_date        47954
visitee_namelast      6069
visitee_namefirst    47953
meeting_room         47954
description           8053
dtype: int64

In [13]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47954 entries, 0 to 47953
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               47954 non-null  object
 1   appt_made_date     47954 non-null  object
 2   appt_start_date    47954 non-null  object
 3   appt_end_date      47954 non-null  object
 4   visitee_namelast   6069 non-null   object
 5   visitee_namefirst  47953 non-null  object
 6   meeting_room       47954 non-null  object
 7   description        8053 non-null   object
dtypes: object(8)
memory usage: 2.9+ MB

In [15]:
data_frame.describe()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
count,47954,47954,47954,47954,6069,47953,47954,8053
unique,37924,353,1174,193,112,102,148,169
top,Alan C. Prather,2015-12-14T00:00:00,6/15/15 15:15,6/15/15 23:59,Velz,POTUS,State Floo,military honor guard
freq,32,1812,3064,3246,1453,27871,22670,1030

In [22]:
data_frame["visitee_namefirst"].value_counts(normalize=True) * 100

visitee_namefirst
POTUS              58.121494
POTUS/FLOTUS       26.457156
potus               5.847392
POTUS/Peter         3.030050
President           0.890455
                     ...
POTUS/Elizabeth     0.002085
POTUS/Gregg         0.002085
Evan                0.002085
POTUS/Dominique     0.002085
Brian               0.002085
Name: proportion, Length: 102, dtype: float64

In [37]:
pd.to_datetime(data_frame["appt_start_date"], format="%m/%d/%y %H:%M").head(5)

0   2015-01-06 09:30:00
1   2015-01-06 09:30:00
2   2015-01-06 09:30:00
3   2015-01-06 09:30:00
4   2015-01-06 09:30:00
Name: appt_start_date, dtype: datetime64[ns]

In [39]:
pd.to_datetime(data_frame["appt_start_date"], format="%m/%d/%y %H:%M").dt.time.head(5)

0    09:30:00
1    09:30:00
2    09:30:00
3    09:30:00
4    09:30:00
Name: appt_start_date, dtype: object

In [56]:
data_frame[(data_frame["appt_end_date"]>"1/6/15 23:59") & (data_frame["appt_start_date"]<"1/7/15 23:59")]

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
139,Mary K. Henry,2015-01-05T00:00:00,1/7/15 11:30,1/7/15 23:59,NaN,POTUS,WW Lobby,Travel w POTUS WW Lobby to West Exec.
140,Leo W. Gerard,2015-01-05T00:00:00,1/7/15 11:30,1/7/15 23:59,NaN,POTUS,WW Lobby,Travel w POTUS WW Lobby to West Exec.
141,Leo W. Gerard,2015-01-06T00:00:00,1/7/15 11:30,1/7/15 23:59,NaN,POTUS,WW Lobby,Travel w POTUS WW Lobby to West Exec.
142,Lee A. Saunders,2015-01-05T00:00:00,1/7/15 11:30,1/7/15 23:59,NaN,POTUS,WW Lobby,Travel w POTUS WW Lobby to West Exec.

In [54]:
data_frame["visitee_namefirst"].nunique()

102

In [60]:
data_frame.dtypes

name                 object
appt_made_date       object
appt_start_date      object
appt_end_date        object
visitee_namelast     object
visitee_namefirst    object
meeting_room         object
description          object
dtype: object

In [63]:
data_frame["name"].astype(str).head(3)

0    Joshua T. Blanton
1      Jack T. Gutting
2    Bradley T. Guiles
Name: name, dtype: object

In [66]:
data_frame["name"].isin(["Joshua T. Blanton"]).head()

0     True
1    False
2    False
3    False
4    False
Name: name, dtype: bool